package String.TaskT03N10;

public class Main {
    public static void main(String[] args) {
        //В Java можно «запросить» и вывести на экран любой символ из кодировки ASCII. Например код System.out.print((char)36);
        // выведет на экран символ с номером 36 — знак доллара $. Таким способом можно выводить любой символ.
        //Задание
        //Найдите в интернете таблицу кодов ASCII. Выведите на экран своё имя на латинице, используя эту таблицу.
        System.out.println((char) 65 + "" + (char) 108 + "" +(char) 101 + "" + (char) 107 + "" + (char) 115 + "" + (char) 101 + "" + (char)  121);
    }
}
